# @time: 2021/12/10 6:05 下午
# Author: pan
# @File: 03函数参数的混合使用.py
# @Software: PyCharm

"""
位置参数  默认参数  可变位置参数  关键字参数  可变关键字参数
位置参数永远在关键字参数前面
默认参数在位置参数后面
"""


# 混合使用
def func(x, y, z, a, b, c):
    print(x)
    print(y)
    print(z)
    print(a)
    print(b)
    print(c)

# >>>>>>>>>>>  调用的时候 遵循关键字参数在位置参数参数后面   <<<<<<<<<<<<<

# 在传入实参数的时候 传入y 那么y就会当成关键字参数
# y后面的都是关键字参数
# 从第一个传入关键字的位置后面都是关键字参数
# func(111, y=222, *[1, 2], **{"b": 10, "c": 20})
# func(111, y=222, 333, 444, **{"b": 10, "c": 20})

# 前面四个是位置参数 后面两个是关键字参数
# func(111, 222, 333, 444, **{"b": 10, "c": 20})
# 前面四个会默认赋值给 x, y, z, a  这时候再设置一个a 那么就是重复定义了
# func(111, *[222, 333, 444], a = 10, **{"b": 10, "c": 20})
# success
# func(111, *[222, 333], a = 666, **{"b": 10, "c": 20})

# 关键字实参数的位置可以任意放
# func(111, *[222, 333], **{"b": 10, "c": 20}, a = 10)


func(111, *[222, 333], b=100, c=2000, a=10)
